results/172.31.26.20:5000/2021-02-26-15-41-23/summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.31.26.20 (be patient)...INFO: POST header == 
---
POST /api/nlp/v2/intent?userid=5f427f94a5c7f67b3985cc8d HTTP/1.0
Content-length: 31
Content-type: application/json
authorization: YaMtrXkKMTvxB8E4L8uW77YMcxSSL4KQ
Host: 172.31.26.20:5000
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:23 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:24 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:24 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:24 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:24 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:24 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:41:24 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
..done


Server Software:        gunicorn/20.0.4
Server Hostname:        172.31.26.20
Server Port:            5000

Document Path:          /api/nlp/v2/intent?userid=5f427f94a5c7f67b3985cc8d
Document Length:        39 bytes

Concurrency Level:      25
Time taken for tests:   0.988 seconds
Complete requests:      25
Failed requests:        0
Total transferred:      5575 bytes
Total body sent:        6675
HTML transferred:       975 bytes
Requests per second:    25.30 [#/sec] (mean)
Time per request:       988.239 [ms] (mean)
Time per request:       39.530 [ms] (mean, across all concurrent requests)
Transfer rate:          5.51 [Kbytes/sec] received
                        6.60 kb/s sent
                        12.11 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.1      1       1
Processing:   213  632 254.6    653     987
Waiting:      213  632 254.8    653     987
Total:        214  633 254.6    654     987

Percentage of the requests served within a certain time (ms)
  50%    641
  66%    788
  75%    849
  80%    951
  90%    963
  95%    984
  98%    987
  99%    987
 100%    987 (longest request)